      * Prints a simple string
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       AUTHOR. kenjihirabayashi
       PROCEDURE DIVISION.
       DISPLAY 'Hello World'.
       STOP RUN.
